data/perf/yield-d98873cda906/memcached/tsan-stmt-yoff/run5/memtier.txt
10        Threads
50        Connections per thread
100000    Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       152405.67          ---          ---         4.93403         4.83100        12.47900        16.12700     10401.64 
Gets      1524039.93      1223.81   1522816.12         4.90477         4.83100        12.41500        16.06300     38603.01 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1676445.60      1223.81   1522816.12         4.90743         4.83100        12.41500        16.06300     49004.65 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       142770.93          ---          ---         5.15944         5.05500        12.54300        16.25500      9744.07 
Gets      1427693.63      1146.44   1426547.19         5.12703         5.02300        12.41500        16.19100     36162.62 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1570464.56      1146.44   1426547.19         5.12997         5.02300        12.47900        16.19100     45906.69 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       148525.64          ---          ---         4.98073         4.89500        12.41500        16.06300     10136.83 
Gets      1485240.04      1077.89   1484162.15         4.95067         4.86300        12.35100        16.06300     37613.30 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1633765.67      1077.89   1484162.15         4.95341         4.86300        12.35100        16.06300     47750.13